backend/testing/artillery-auth.yml
config:
  target: "https://trip-sync-botj.onrender.com"

  phases:
    - duration: 60
      arrivalRate: 5

scenarios:

  - name: Authenticated APIs

    flow:

      - get:
          url: "/api/users/profile"

          headers:
            Authorization: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjZhNGMwMTBkYjcwYzUzOGU0MDlmYjgzOSIsImlhdCI6MTc4MzM2NjY1MiwiZXhwIjoxNzgzOTcxNDUyfQ.StpgVKojgvyw7y2VKo_HeStBNJxUFSF_syLQaGMyWGg"

      - get:
          url: "/api/trips/6a4b51b4b945d3ef2e354b1b"

          headers:
            Authorization: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjZhNGMwMTBkYjcwYzUzOGU0MDlmYjgzOSIsImlhdCI6MTc4MzM2NjY1MiwiZXhwIjoxNzgzOTcxNDUyfQ.StpgVKojgvyw7y2VKo_HeStBNJxUFSF_syLQaGMyWGg"