backend/testing/artillery-join.yml
config:
  target: "https://trip-sync-botj.onrender.com"

  phases:
    - duration: 60
      arrivalRate: 5

scenarios:
  - name: Join Trip

    flow:

      - post:

          url: "/api/trips/6a4b51b4b945d3ef2e354b1b/join"

          headers:
            Authorization: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjZhNGMwMTBkYjcwYzUzOGU0MDlmYjgzOSIsImlhdCI6MTc4MzM2NjY1MiwiZXhwIjoxNzgzOTcxNDUyfQ.StpgVKojgvyw7y2VKo_HeStBNJxUFSF_syLQaGMyWGg"